<div class="single-product">
        <div class="inner">
            <button onclick="history.back();" class="back-category">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="#A5A8B4" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M4 12C4 11.4477 4.44772 11 5 11H19C19.5523 11 20 11.4477 20 12C20 12.5523 19.5523 13 19 13H5C4.44772 13 4 12.5523 4 12Z" />
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M12.7071 4.29289C13.0976 4.68342 13.0976 5.31658 12.7071 5.70711L6.41421 12L12.7071 18.2929C13.0976 18.6834 13.0976 19.3166 12.7071 19.7071C12.3166 20.0976 11.6834 20.0976 11.2929 19.7071L4.29289 12.7071C3.90237 12.3166 3.90237 11.6834 4.29289 11.2929L11.2929 4.29289C11.6834 3.90237 12.3166 3.90237 12.7071 4.29289Z" />
                </svg>
                Стандартні шкарпетки
			</button>
            <div class="product__list">
                <div class="product__descr">
                    <div class="product__head">
                        <div class="product__name">
                            <h1 class="name">Ананаси</h1>
                            <span class="cat">Стандартні шкарпетки</span>
                        </div>
                        <div class="product__material">
                            <span class="material">
                                <img src="img/cat/mat1.png" alt="">
                                Бавовна - 97%
                            </span>
                            <span class="material">
                                <img src="img/cat/mat2.png" alt="">
                                Полiестер - 3%
                            </span>
                        </div>
                    </div>
                    <div class="product__attr">
                        <div class="variation__wrap">
                            <span class="var-title">Кількість</span>

                            <div class="variation-quantity">
                                <button class="quant q-minus">-</button>
                                <input type="number" class="quantity" value="1" disabled>
                                <button class="quant q-plus">+</button>
                            </div>
                        </div>

                        <div class="variation__wrap">
                            <div class="variation-size">

                                <span class="var-title">Розмір</span>

                                <div class="size-container">
                                    <div class="var-size">
                                        <label for="radio" class="label-size">
                                            30 - 35
                                            <input id="radio" type="radio" name="group1">
                                        </label>

                                    </div>

                                    <div class="var-size">
                                        <label for="radio1" class="label-size1">
                                            40 - 45
                                            <input id="radio1" type="radio" name="group1">
                                        </label>
                                    </div>

                                    <div class="var-size">
                                        <label for="radio1" class="label-size1">
                                            40 - 45
                                            <input id="radio1" type="radio" name="group1">
                                        </label>
                                    </div>

                                    <div class="var-size">
                                        <label for="radio1" class="label-size1">
                                            40 - 45
                                            <input id="radio1" type="radio" name="group1">
                                        </label>
                                    </div>
                                </div>

                            </div>
                        </div>
                    </div>
                    <div class="product__buy">
                        <div class="product__price">
                            <span class="price__title">Всього до Сплати:</span>
                            <span class="price">70 ₴</span>
                        </div>
                        <div class="product__add-cart">
                            <button class="add-to-cart">
                                <img src="img/sp/cart.png" alt="">
                                Додати до Кошика
                            </button>
                        </div>
                    </div>
                    <div class="product__description">
                        <p class="descr">
                            Бувають в житті ситуації, коли хочеться просто втнути щось дуже незвичне, максимально
                            підняти собі настрій чи просто побути трішки в центрі всезагальної уваги. Саме для такого
                            разу і створені авторські носки «Ананаси». Так і виплескують емоції від одного лише їхнього
                            вигляду. Рожевий, м’ятний, жовтий та зелений ненав’язливо поєднались, створюючи оригінальний
                            ансамбль яскравих кольорів та літнього настрою. Безумовно, така корисна та весела річ
                            повинна бути в гардеробі кожної сучасної незакомплексованої особи. Гармонійно поєднаються
                            шкарпетки «Ананас» із балетками, кедами, кросівками чи мокосінами нейтральних кольорів. <br>
                            Модель має завищену гумку. Завдяки такій шкарпетки не сповзатимуть з ніг, не виділятимуться
                            під штанами-скінами. Натуральний бавовняний склад матеріалу, робить шкарпетки «Ананас»
                            ідеальним варіантом для як для літнього, так і для зимового періоду. Вони легко пропускають
                            повітря, але при цьому залишаються м’якими та комфортними.
                        </p>
                    </div>
                </div>
                <div class="product__thumb">
                    <div class="thumb">
                        <img src="img/sp/thumb.png" alt="">
                    </div>
                    <div class="product__social">
                        <span class="soc__title">Підпишись на наші мережі і будеш отримувати новинки та акції!</span>
                        <div class="product-soc__list">
                            <a href="#" class="product-social__link">
                                <svg width="18" height="18" viewBox="0 0 18 18" fill="#FFF"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M2 0H16C16.5304 0 17.0391 0.210714 17.4142 0.585786C17.7893 0.960859 18 1.46957 18 2V16C18 16.5304 17.7893 17.0391 17.4142 17.4142C17.0391 17.7893 16.5304 18 16 18H2C1.46957 18 0.960859 17.7893 0.585786 17.4142C0.210714 17.0391 0 16.5304 0 16V2C0 1.46957 0.210714 0.960859 0.585786 0.585786C0.960859 0.210714 1.46957 0 2 0ZM15 2H12.5C11.5717 2 10.6815 2.36875 10.0251 3.02513C9.36875 3.6815 9 4.57174 9 5.5V8H7V11H9V18H12V11H15V8H12V6C12 5.73478 12.1054 5.48043 12.2929 5.29289C12.4804 5.10536 12.7348 5 13 5H15V2Z" />
                                </svg>
                            </a>
                            <a href="#" class="product-social__link">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="#FFF"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M7.8 2H16.2C19.4 2 22 4.6 22 7.8V16.2C22 17.7383 21.3889 19.2135 20.3012 20.3012C19.2135 21.3889 17.7383 22 16.2 22H7.8C4.6 22 2 19.4 2 16.2V7.8C2 6.26174 2.61107 4.78649 3.69878 3.69878C4.78649 2.61107 6.26174 2 7.8 2ZM7.6 4C6.64522 4 5.72955 4.37928 5.05442 5.05442C4.37928 5.72955 4 6.64522 4 7.6V16.4C4 18.39 5.61 20 7.6 20H16.4C17.3548 20 18.2705 19.6207 18.9456 18.9456C19.6207 18.2705 20 17.3548 20 16.4V7.6C20 5.61 18.39 4 16.4 4H7.6ZM17.25 5.5C17.5815 5.5 17.8995 5.6317 18.1339 5.86612C18.3683 6.10054 18.5 6.41848 18.5 6.75C18.5 7.08152 18.3683 7.39946 18.1339 7.63388C17.8995 7.8683 17.5815 8 17.25 8C16.9185 8 16.6005 7.8683 16.3661 7.63388C16.1317 7.39946 16 7.08152 16 6.75C16 6.41848 16.1317 6.10054 16.3661 5.86612C16.6005 5.6317 16.9185 5.5 17.25 5.5ZM12 7C13.3261 7 14.5979 7.52678 15.5355 8.46447C16.4732 9.40215 17 10.6739 17 12C17 13.3261 16.4732 14.5979 15.5355 15.5355C14.5979 16.4732 13.3261 17 12 17C10.6739 17 9.40215 16.4732 8.46447 15.5355C7.52678 14.5979 7 13.3261 7 12C7 10.6739 7.52678 9.40215 8.46447 8.46447C9.40215 7.52678 10.6739 7 12 7ZM12 9C11.2044 9 10.4413 9.31607 9.87868 9.87868C9.31607 10.4413 9 11.2044 9 12C9 12.7956 9.31607 13.5587 9.87868 14.1213C10.4413 14.6839 11.2044 15 12 15C12.7956 15 13.5587 14.6839 14.1213 14.1213C14.6839 13.5587 15 12.7956 15 12C15 11.2044 14.6839 10.4413 14.1213 9.87868C13.5587 9.31607 12.7956 9 12 9Z" />
                                </svg>
                            </a>
                            <a href="#" class="product-social__link">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="#FFF"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M22.46 6C21.69 6.35 20.86 6.58 20 6.69C20.88 6.16 21.56 5.32 21.88 4.31C21.05 4.81 20.13 5.16 19.16 5.36C18.37 4.5 17.26 4 16 4C13.65 4 11.73 5.92 11.73 8.29C11.73 8.63 11.77 8.96 11.84 9.27C8.28004 9.09 5.11004 7.38 3.00004 4.79C2.63004 5.42 2.42004 6.16 2.42004 6.94C2.42004 8.43 3.17004 9.75 4.33004 10.5C3.62004 10.5 2.96004 10.3 2.38004 10C2.38004 10 2.38004 10 2.38004 10.03C2.38004 12.11 3.86004 13.85 5.82004 14.24C5.46004 14.34 5.08004 14.39 4.69004 14.39C4.42004 14.39 4.15004 14.36 3.89004 14.31C4.43004 16 6.00004 17.26 7.89004 17.29C6.43004 18.45 4.58004 19.13 2.56004 19.13C2.22004 19.13 1.88004 19.11 1.54004 19.07C3.44004 20.29 5.70004 21 8.12004 21C16 21 20.33 14.46 20.33 8.79C20.33 8.6 20.33 8.42 20.32 8.23C21.16 7.63 21.88 6.87 22.46 6Z" />
                                </svg>
                            </a>
                            <a href="#" class="product-social__link">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="#FFF"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M20.7999 7.74C20.9299 7.32 20.8 7 20.18 7H18.16C17.64 7 17.41 7.27 17.28 7.57C17.28 7.57 16.25 10.08 14.79 11.72C14.31 12.19 14.1 12.34 13.84 12.34C13.71 12.34 13.5 12.19 13.5 11.76V7.74C13.5 7.23 13.38 7 12.95 7H9.75995C9.43995 7 9.24995 7.24 9.24995 7.47C9.24995 7.95 9.99995 8.07 10.05 9.44V12.42C10.05 13.08 9.92995 13.2 9.67995 13.2C8.99995 13.2 7.31995 10.67 6.32995 7.79C6.12995 7.23 5.93995 7 5.41995 7H3.38995C2.81995 7 2.69995 7.27 2.69995 7.57C2.69995 8.11 3.38995 10.77 5.89995 14.29C7.56995 16.7 9.92995 18 12.08 18C13.37 18 13.53 17.71 13.53 17.21V15.39C13.53 14.82 13.65 14.7 14.06 14.7C14.36 14.7 14.87 14.85 16.07 16C17.45 17.38 17.67 18 18.45 18H20.4699C21.0499 18 21.34 17.71 21.18 17.14C21 16.57 20.34 15.74 19.4699 14.76C19 14.21 18.29 13.61 18.07 13.3C17.77 12.92 17.86 12.75 18.07 12.4C18.07 12.4 20.5399 8.93 20.7999 7.74Z" />
                                </svg>
                            </a>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>